import { ExcursionData } from "@/types/tour"

export const excursionData: ExcursionData = [
  {
    id: 0,
    name: "Парк Солнечный остров 太阳岛风景区",
    address: "Sun Island Scenic Area, Songbei District (松北区太阳岛风景区)",
    hours: "8:00-17:00",
    price:
      "Взрослый 30 юаней, детский 15 юаней. Электромобиль по парку 20 юаней с человека",
    description:
      "На севере острова расположены зоны с животными и растениями. На южной части есть музеи и галереи. Павильон льда и снега(冰雪艺术馆）расположен на западе парка и занимают площадь 5000 квадратных метров, является самым большим крытым музеем льда и снега в мире. Зал работает круглый год. Русская деревня (俄罗斯风情小镇）находится в южной части острова и примыкает к берегу реки Сунгари. Комплекс состоит из 27 зданий в русском стиле начала ХХ века. Выставочный зал России расположен в северо-восточной части парка. На востоке острова расположен Зал изделий Северного Китая (北方民艺精品馆). Здесь представлены резные изделия из дерева и слоновой кости, поделки из березы, глиняные изделия и многое другое. Также на острове есть остров белок, лебединое озеро, олений парк и цветочный сад",
    duration: "Весь день до закрытия парка",
    directions:
      "От гостиницы до метро 646 метров пешком. На метро: 2 ветка (зеленая)中央大街站 Zhongyangstreet（вход 1) проехать 2 остановки и выйти на остановке 太阳岛站 Sun Island (выход 3) пройти 459 метров до входа парка 1",
    travelTime: "23 минуты",
    baiduUrl: "https://j.map.baidu.com/3c/sGhk",
    omapsUrl: "https://omaps.app/_8UYCncZte/",
    tips: "Парк очень большой и во время праздничных выходных возможны очереди. Обратно можно воспользоваться канатной дорогой 松花江索道 у выхода 3 из парка. Стоимость билета 60 юаней в одну сторону на человека",
  },
  {
    id: 1,
    name: "Главная пешеходная улица 中央大街",
    address: "中央大街步行街",
    hours: "Круглосуточно",
    price: "Бесплатно",
    description:
      "Это самая длинная пешеходная улица в Азии. Ее длина 1450 метров, ширина вместе с тротуарами - 21,34м",
    duration: "3-4 часа",
    directions:
      "Метро: с остановки Kaishengyuan Plaza 凯盛源广场站 проехать 12 остановок до People's square 人民广场站 пересесть на 2 ветку(зеленая) проехать 1 остановку и выйти на  Zhongyang Street 中央大街站（выход 2). Надо будет пройти 557 метров и вы окажетесь на пешеходной улице. Нужно идти в сторону набережной реки Сунгари.",
    travelTime: "48 минут",
    baiduUrl: "https://j.map.baidu.com/c5/Q3ik",
    omapsUrl: "https://omaps.app/88UYCab0xx/",
    tips: "",
  },
  {
    id: 2,
    name: "Софийский собор и Софийская площадь 圣索菲亚教堂",
    address: "道里区 透笼街88号",
    hours: "Круглосуточно",
    price: "Бесплатно",
    description:
      "Это не действующий православный храм. Один из символов Русского Харбина",
    duration: "30 минут",
    directions:
      "Метро: с остановки Kaishengyuan Plaza 凯盛源广场站 проехать 12 остановок до People's square 人民广场站 пересесть на 2 ветку(зеленая) проехать 2 остановки до Shangzhi Street 尚志大街站 (выход 1). Надо будет пройти 838 метров пешком до собора.",
    travelTime: "53 минуты",
    baiduUrl: "https://j.map.baidu.com/ad/T4Kk",
    omapsUrl: "https://omaps.app/08UYCbs8Fx/",
    tips: "",
  },
  {
    id: 3,
    name: "Район Китайского Барокко 中华巴洛克历史文化区",
    address: "道外区南头道街64号",
    hours:
      "Территория квартала: открыта круглосуточно (освещение вечером). - Музеи и магазины: 9:00–17:00 (некоторые до 20:00). - Рестораны и кафе: 10:00–22:00.",
    price:
      "Вход в район: бесплатно. - Отдельные музеи: 10–30 юаней (например, музей истории квартала). - Экскурсии с гидом: от 100 юаней (групповые).",
    description:
      "Уникальный исторический квартал, где европейское барокко сочетается с китайскими элементами. Построен в начале XX века как деловой центр Харбина, сегодня – это музей под открытым небом с: - Архитектурой в стиле «китайского барокко»: фасады с колоннами, лепниной и традиционными китайскими мотивами. - Старыми магазинами, чайными и ресторанами с местной кухней. - Музеями и мастерскими (например, музей старинной фотографии). - Атмосферными двориками и пешеходными улочками. Идеальное место для фото, прогулок и погружения в историю Харбина.",
    duration: "1-2 часа",
    directions:
      "Метро: с остановки Kaishengyuan Plaza 凯盛源广场站 3 ветка желтая проехать 15 остановок до Beima Road北马路站 4 выход и пройти еще 604 метра",
    travelTime: "47 минут",
    baiduUrl: "https://j.map.baidu.com/97/u4Kk",
    omapsUrl: "https://omaps.app/w8UYC26oHc/",
    tips: "",
  },
  {
    id: 4,
    name: "Фармацевтическая фабрика в Харбине 哈药集团制药六厂 (Harbin Drug Group Pharmaceutical Factory 6)",
    address: "道外区-南直路326号",
    hours: "11:00-16:00",
    price: "БЕСПЛАТНО (нужен паспорт)",
    description:
      "Здание снаружи выглядит будто гуляешь по Питеру или европейскому городку. А внутри — настоящий дворец: лепнина, золото, картины. Можно сделать классные и необычные фотки на память, заглянуть в сувенирные лавочки внутри дворца — там много интересного.",
    duration: "1-2 часа",
    directions: "На такси 29 минут",
    travelTime: "50 минут",
    baiduUrl: "https://j.map.baidu.com/7c/t0Kk",
    omapsUrl: "https://omaps.app/08UYDY6ym4/",
    tips: "",
  },
  {
    id: 5,
    name: "Храм Цзилэсы 哈尔滨极乐寺",
    address: "南岗区东大直街9号",
    hours: "08:00-15:30",
    price: "10 юаней",
    description:
      "Один из самых известных буддийских храмов на северо-востоке Китая. Храм был основан в 1923 году при поддержке китайских буддистов и является одним из четырёх крупнейших буддийских монастырей северного Китая. Его строительство связано с распространением буддизма среди китайских переселенцев и русской эмиграции в Харбине в начале XX века. Храм построен в традиционном китайском стиле с элементами буддийской архитектуры. На его территории находятся: - Главный зал Махавиры (大雄宝殿) — посвящён Будде Шакьямуни. - Зал Небесных Царей (天王殿) — здесь находятся статуи четырёх небесных стражей. - Пагода Пятисот Архатов — символизирует достижение просветления. - Колокольня и барабанная башня — традиционные элементы китайских храмов.",
    duration: "1-2 часа",
    directions:
      "Метро: с остановки Kaishengyuan Plaza 凯盛源广场站 проехать 2 остановки до The Second Affiliated Hospital of Harbin medical University пересесть на 1 ветку(красная) проехать 11 остановок до Harbin engineering university 工程大学站 (выход 1) пройти 546 метров",
    travelTime: "45 минут",
    baiduUrl: "https://j.map.baidu.com/6b/gnik",
    omapsUrl: "",
    tips: "",
  },
  {
    id: 6,
    name: "Харбинский большой театр (Harbin Grand Theatre) 哈尔滨大剧院",
    address: "松北区-大剧院街1号",
    hours: "09:00-17:30",
    price: "380 юаней",
    description:
      "Куплены билеты на концерт изящная музыка Династии Тан. Колокола и барабаны, гастроли оркестра барабанщиков МИД Сианя в Харбине 10.05.2025г. В 19:00",
    duration: "3-4 часа",
    directions: "На такси",
    travelTime: "40 минут",
    baiduUrl: "https://j.map.baidu.com/9e/1RJ",
    omapsUrl: "https://omaps.app/w8UYIJttlm/",
    tips: "",
  },
]
